{"podcast_details": {"podcast_title": "Dear Alana,", "episode_title": "Part 3: My Secret", "episode_image": "https://www.omnycontent.com/d/programs/e73c998e-6e60-432f-8610-ae210140c5b1/edf8da6f-41bb-4c0f-89b1-b050016df7b4/image.jpg?t=1692304203&size=Large", "episode_transcript": " No one likes to talk about money. Am I saving enough? Can I buy a house? Am I paying too much in taxes? Will I be able to retire? What if you could unlock insights about your finances in less than five minutes with a clear picture of where you stand today and where your money can work harder? Now you can. Visit facet.com to take the free quiz and get your financial wellness score today. That's F-A-C-E-T dot com. This ad is sponsored by Facet. Facet Wealth Incorporated is an SEC registered investment advisor. This is not an offer to buy or sell securities, nor is it investment, legal, or tax advice. Are you ready to move your career forward? Make your comeback with Purdue Global and get college credit for your work, school, life, or military experiences. With these credits, you may have already completed up to 75 percent of your undergraduate degree. You've worked hard to get where you are. It's time to get the recognition you deserve and earn a degree you'll be proud of, one that employers will trust and respect. When you take the next step in your life and career, make it count with Purdue Global, Purdue's online university for working adults. Start your comeback at PurdueGlobal.edu. Dear Alana is released weekly and brought to you absolutely free. But if you want to binge the whole season right now, subscribe to TenderfootPlus at tenderfootplus.com or on Apple podcasts. You'll also get exclusive bonus episodes throughout the season. For more information, check out the show notes. Enjoy the episode. The following episode contains references to suicide. If you or someone you know is in need of help, please contact the Suicide and Crisis Lifeline by dialing 988. Listener discretion is advised. I was wearing black Sophie shorts and a gray t-shirt. I took the bus to see him. We sat in his office. I felt uncomfortable with my short pants. I felt uncomfortable with my short shorts and bare legs. He didn't say anything though. He was covered in black, glasses, hair cut close to the skull. He was young and funny and passionate. He noticed me. He knew me. He knew I loved God. He forgave my unspeakable sin. He took my defilement and buried it. He kept my secret. It's Wednesday night and I'm happy to be back home in San Francisco. I'm sitting at the back of my local parish for an evening prayer service. Good evening and welcome to our celebration of prayer and song in the prayer style of T-Day. The church is lit by candlelight and I'm struck by how beautiful it is. Whenever I'm here, I feel like I can just let my thoughts roam free. Tonight, they'll be playing music written by a group of monks from a small town in eastern France. Somehow, these men ran away from it all and wrote the melancholic melodies we're hearing this evening. I'm thinking about my last conversation with Joyce and I'm eager to get back to Colorado in order to go through Alana's journals for myself. But a part of me is uneasy. How many of us keep diaries and journals of our deepest thoughts and feelings, where we confide our insecurities, our secrets, and our dreams? In our journals, we get to be totally unfiltered because it helps us process things and because we don't expect anyone to ever read them. But what does it mean if someone gains access to them when we're gone, before we've had a chance to give them permission to do so? That's the dilemma I'm weighing this evening. As I stare at the flickering candles, I recall a paragraph that I had happened upon as we were flipping through Alana's journals in Joyce's kitchen. It's a nondescript line, barely noticeable, but it's stuck with me. Alana says, It's hard to write just for me. I just want to write down my life in a small journal tucked away somewhere in this world. I want to be in this world. I want to be a part of this world. I feel invisible. All my life, I've been hiding away, waiting for someone to find me. Maybe she tucked her journals away, waiting for someone to find them. Maybe that someone was me. From Tenderfoot TV, I'm Simon Kent-Fung, and this is Dear Alana. Part 3. My Secret. Alana left behind 20 journals, and with Joyce's permission, I digitally scanned every page, even the ones that had only a few lines on them. In total, nearly 1200 pages. It's worth noting that in some journals, Alana ripped out pages, and we may never know why. It felt important to give her journals a voice, so we found a voice actress, coincidentally also named Alana, to help us with that, and you'll hear her voice throughout the series. As I begin reading her journals, I can see right away that Alana keeps really detailed notes. She likes to track things on timelines and lists. In one journal, she breaks her life out into big chapters titled, California, where she was born. Born October 1995. Separation anxiety. Mom and dad, constant fighting. Middle school. Moved to Colorado in 2000. Dad called me too sensitive. A baby. Wild imagination. Extreme fear of monsters. Can't sleep. Elementary school. Extremely shy. Joy made all my friends for me. Perfectionist in school. Perfectionist in art. At high school. Conversion. Decided to follow Jesus forever. She's very matter of fact, with bullet points under each chapter. This timeline makes it quite easy for me to cross-reference things I'll find later on. A lot of her journals contain what we've come to expect from Alana. Prayers. So many prayers. And lists of people she's remembering to pray for, like... Pray for Alexis, Erin, Newhawd, Katie, Ashley, the girl in the station on the way home from Texas, the girl in the Albertson parking lot, and her grandkids. There are frisbee plays and arguments with mom. And as I continue reading, what leaps out to me the most is just how into God she is. Where you'd expect to find high school gossip and crushes, Alana gushes with that same energy. But for God... Lord, I love that you're leading me. I love that you asked me here on a date. I love that you desire a greater intimacy with me. I desire it too. I think someday we will be married. Soon, all that I am will be 100% yours. Lead me forever closer to your sacred heart. I love you. Wow. A date with God? That's intense. We get a little more in the next paragraph, like a follow-up text. Dear God, I wanted to write you a little ditty note because I'm so tired and distracted. Our date was for me a very delirious thing. I love you. Since you'll be in here all day, I'll call you often. Pray with me that I may not fear, and grant that I may have interior silence. The days are so busy. Let it help and not hinder me from an intimate relationship with you. Have a good day. Save me a seat at Mass. Love your girl, Alana. I'm sure by now you've picked up that Alana's experience of Catholicism is a little out of the ordinary. Most Catholics get the basics of their faith from their parents or Catholic school, then fade out from the church, or maybe show up once in a while at Christmas or Easter. They don't sneak out during the week to go to Mass, or write passionate love letters to God. Alana uses phrases like, jumping into the ocean of the Father's love, and, grant that I may have interior silence. These are spiritual concepts that are lifted right out of the mystical writings of 17th century European saints, people who had uniquely powerful experiences of God who were speaking of their era. Gen Z millennials don't talk like that, no matter how much they're in love. It's a sunny afternoon and I'm back in Lewisville, Colorado, the town where Alana grew up. I'm walking the downtown strip and finally make it to my destination, the local ice cream shop, Sweet Cow, where Alana used to work. Today, in memory of Alana's birthday, they're giving a proceed of all purchases to support mental health resources. Joyce is sitting outside with some of her friends. Hi! Oh, this is the area! Sophie, come over here. They're exchanging stories about Alana. I get a cup of chocolate oatmeal stout and sit down to join them. As they reminisce about Alana, the conversation starts to move from nostalgia to anger. There's no religion. They must have been a Catholic. There's a sense that the church was somehow responsible, that its influence on Alana was a big part of why she took her life. I can understand if it's friends and family reckoning with their grief and looking for closure, and the church can be an easy target. But what exactly happened in the church, something that Alana clearly loved, that could lead to such a terrible outcome? She left all her journals, but there's something that was there. Like Joyce's friends, I'm wondering if her journals might offer some clues. As I leave the ice cream shop, I'm starting to feel the weight of responsibility I have on my shoulders with Alana's writings. It's time to get back into them. He'll forget about the video game you gave him on his birthday. Wow! Thanks, Grandpa! But he'll never forget how you invested in his future with the Younest app. Wow. Thanks, Grandpa. Don't just give them any gift. Give them a gift that can grow with them. Invite grandparents and family friends to contribute to your child's future with the Younest app. Younest is an investment account for kids that makes it easy to gift funds that can be used for college tuition, their first home, and more, just by sharing the link. Or include a Younest QR code on party invitations for birthdays and holidays. For a limited time, download the Younest app and use the code IHART50 at sign up to receive a $50 bonus when you fund your account. That's code IHART50 when you sign up at unest.co for a $50 bonus. See terms and conditions at unest.co. CuriosityStream is the streaming service built by and for people who want to know more. More about our world and beyond. CuriosityStream has the best collection of documentary films and TV shows about everything from the history of human migration to the future of space travel. With thousands of titles, Curiosity has something for everyone. Science, wildlife, travel, human stories, culture, and pretty much anything you're curious about. Watch CuriosityStream on your TV or any digital device all around the world. Just go to curiositystream.com to sign up or download the app now. You'll have access to brand new titles dropping every week, filled with new discoveries and new stories that'll open your eyes to the world around us. And with monthly, annual, and bundled pricing plans, it's easy to find one that works for you and your budget. Go to curiositystream.com to satisfy your curiosity and sign up today. Only one thing is important. Eternal salvation. Only one thing, therefore, is to be feared. Sin. Like Alana, I didn't grow up in a particularly devout family, but I still had a very intuitive sense of right and wrong. As a child, I once felt so guilty for taking the sewing kit from my mom's drawer to play with it in my bedroom that I ran crying to her the next day, begging her to forgive me for stealing. Alana, it seems, was just as careful. There are literally dozens of pages where she writes out her sins. Jealous of others. Lied about daylight savings. Lied to parents about going to mass. Let ultimate keep me from the Lord. Used to be pro-choice and for gay marriage. Kissed a friend on the cheek without realizing the damage. Facebook stalking. Insecure, especially in middle school. Obsessed with how I looked. Ungrateful for the gifts God had given me. Face. Hair. Wanted to be somebody else. To be clear, a lot of these are not sins, but Alana thinks they are. I feel bad. I just opened the bathroom door on someone. I'm sorry. Please forgive me. It can be hard being a young person navigating these rules and regulations. Trying to gauge how bad it was that you took the sewing kit or accidentally opened the bathroom door. As I got older, I learned that there was an intricate system to sin. And I found myself gravitating to obscure documents and websites, which laid out all the rules. It was like a secret code. For example, did you know that you have to be at least 7 years old, what the church calls the age of reason, in order to sin? Sins not only break the order of the universe, but also hurt God. Like, personally. Thankfully, there's a way out. If you've committed sins, especially serious, intentional ones, what Catholics call mortal sins, you can be forgiven by going to confession. So she was always in confession. Did she go to confession every week? Every week. And she'd go up and have her arms crossed. And I mean, she was the perfect Catholic. And I was like, what are you? She goes, I didn't go to confession this week. And I said, Alana, you don't have to go every week. Why do you think you have to go every week? And she just said, I have to. And like, that was that was younger. Like, but I couldn't believe it. I just started. All I thought was, wow, she's really, really conservative Catholic. This is over the top. Confession is a sacred space. Nothing said there is allowed to leave it. And because of that, it's where you can share your most private details. Go ahead. In the name of the Father and of the Son and of the Holy Spirit. Amen. Bless me, Father, for I have sinned. It's been about a month since my last confession. Am I most devout? I'd go every week, though the recommendation is to go once a month. These are my sins. I yelled at my dad last weekend. We got in a fight and I said some really nasty things to him. I spoke behind one of my co-workers backs. I had impure and lossful thoughts, especially on my own. There are plenty of confession guides that help you structure your conversation here. But essentially, you go through your list of sins and mention how frequently they occurred since your last confession. And you've got to confess the mortal ones. This is key. Very good. So tell me what the fight was about. The priest might then probe a bit into what you just confessed, give you a bit of informal counseling and advice. Like maybe you should talk to someone about your addiction or see a therapist about your anger. Very well. For your penance, say, 10 Our Fathers and three Hail Marys. And now, please make your act of contrition. Oh my God, I'm truly sorry for all my sins with all my heart. So if you've done all of this and are truly honest to God, sorry for your sins, then when the priest responds with his prayer, And I absolve you from your sins in the name of the Father and of the Son and of the Holy Spirit. Amen. Then your sins are forgiven. You're back in the fold, back to being in a state of grace. For a lot of people, confession is kind of therapeutic. Like you've unloaded these burdens and now you're starting from a clean slate. But for me, I remember stressing out about making sure I did everything right. Making sure I kept careful inventory of all my sins. Making sure I was sorry with all my heart. Sometimes even going back to make a second confession if there was any doubt. And I can see how it might have been the same for Alana. She writes about how she's often anxious at Mass. Dear Lord Jesus, I want true interior freedom in order to serve, praise, and love You. But sometimes I have so much anxiety. Can I be free in the midst of it? And why during Mass? My desires have been so impure that I still feel ashamed. Am I not yet free? Alana's commitment to confession was felt by her siblings. Here's her sister, Carissa, again. She would text me like, hey, you want to hang out? Like we haven't seen each other. I'm like, okay, let's get one. She was like, oh, I was actually thinking we could go to confession. I'm just like, no, that's like not my form of spending time with my sister. Like this feels like a trap. And here's her younger sister. I know I was in middle school when I started getting pushed to go to confession by my sister. And I thought I had a similar interest because I wanted to be like my sister. I remember going and reading this card saying like all the lists of possible sins you could confess. And masturbation was like staring at me. I was young and I thought it was like the most taboo thing ever. I mean, I don't care anymore. But when you're young, it's weird. You don't talk about it, especially as a woman. I was like, oh, my gosh, I have to tell this priest this because God knows I'm doing it. So I'm like, he must know. So I remember doing that and 13 year old me is just doing my Hail Marys at home. But it was very shameful. When I was in seventh grade, my mom made us go to confession. As I was reading the pamphlet, I saw that word that I learned to hate, that thing that I thought I invented. Well, now that I was past age seven, the age of reason, I was culpable for my sins. Alana's reaction to masturbation was different than her sister's. Where Sophia eventually stopped caring about confessing this, Alana doubled down on it, doing the calculus to measure her culpability. All over her journals, Alana obsesses over this subject. At one point in my childhood, I tried to achieve an orgasm for masturbating my armpit. I thought maybe it was just touching my private parts that was bad. And maybe if I could make myself feel good in touching a holier, more innocent part of my body, that it wouldn't be a sin. It obviously didn't work. Even before I knew it was a sin, I was ashamed of what I was doing since before I can remember. When I found out it was a sin, I doubled my efforts to try to stop. I counted the days I could go without doing it. Dear Jesus, I have a lot of problems. I think I have a boy's mind, very dirty. I don't know why, but I'm sorry for preferring weird things over you. It's kind of funny. Not really, but Father D told me not to take myself so seriously, so yeah. But he's right. I just want to praise you and forget about me. You are so good, and I love you. You have the power to make me clean. Give me a clean mind. I love you. Okay, now I will pray for purity. As a teenager, when I learned that masturbation was a mortal sin, also in a pamphlet, these pamphlets seem to have gotten a lot of traction, I became fixated with not doing it. Every time I'd feel the urge, I'd think about how much I'd be hurting God. And it wasn't just fear of hurting Him that stopped me from doing it. I learned about really compelling theological and philosophical reasons for why masturbation was wrong. Through some combination of determination, fear, and perfectionism, I managed to stop masturbating for, and I'm not kidding, over a decade. But I attributed it to God's grace. Summer 2009. I was super depressed. But then, a miracle happened. I was able to give up masturbation at age 13 till I was 20. The abstinence lasted seven years. It looks like Alana had an almost identical experience. She credits her stopping masturbation to a miracle, a sign of God's closeness. And it's not just with masturbation that she's so strict with herself. Here's an ambitious list of what she's giving up for Lent. And in another entry, Her spiritual director, Father David Nix. Mentions of him are becoming so frequent that it's impossible to ignore. Things to tell Father Dave. About cum and C. Pink blanket, lack discipline with mortification, temptations, desires. Father Dave, as you might remember from Alana's earlier writing, is her priest and spiritual director. They meet regularly, and Alana even goes on a student missionary trip he organizes to Rwanda. In her timeline, under a heading titled Father Dave, Alana bullets out, sneak out to meet him, didn't tell parents, first person to really tell about family life. Spiritual directors, and I've had a few, are usually priests who serve as spiritual guides or coaches. You confess to them, and they give you advice, homework, and reading material to help you on your spiritual journey. Again, these are bonus level Catholic practices. Most Catholics don't have spiritual directors. But Alana seems to be relating to him almost like a therapist. Father Dave is from Denver, graduated pre-med, became a paramedic and then a campus missionary before entering the seminary and getting ordained as a priest at the age of 31. His first job, out of the gate, happens to be at St. Tom's, Alana's church. You sent me Father Dave to help me out of my disparate camp. He was the first person I told my temptations to, and through him I felt your endless compassion. First person I told my temptations to. I can guess what she's talking about, but I'm not totally sure. And then I find several entries about a friend. I don't really remember how it started, but somewhere along the line during sophomore year, we became great friends. Then something began to stir deep beneath the surface. It was new to me, but I didn't know what it was or what was happening. During these times, I always convinced myself we were just friends, but some days I imagined us holding hands or sharing a first kiss in her car. At this point, I wanted to tell her how I felt, but it was trapped within me. Father Dave said I should love her more, not less, and pray for her. It seems like Alana is sharing a lot with Father Dave, including her budding feelings for a friend, another girl. Could these be the temptations she's talking about? He'll forget about the video game you gave him on his birthday. Wow! Thanks, Grandpa! But he'll never forget how you invested in his future with the Younest app. Wow! Thanks, Grandpa! Don't just give them any gift. Give them a gift that can grow with them. Invite grandparents and family friends to contribute to your child's future with the Younest app. Younest is an investment account for kids that makes it easy to gift funds that can be used for college tuition, their first home, and more, just by sharing the link. Or include a Younest QR code on party invitations for birthdays and holidays. For a limited time, download the Younest app and use the code IHART50 at sign up to receive a $50 bonus when you fund your account. That's code IHART50 when you sign up at unest.co for a $50 bonus. See terms and conditions at unest.co. CuriosityStream is the streaming service for people who want to know more, more about our world and beyond. CuriosityStream has the best collection of documentary films and TV shows. And now check out Curiosity's new series, The Real Wild West. Rolling Stone Magazine says it's the history of the West they usually don't teach you. The mythology of the West left out a lot of the people. The American West is far more different, far more diverse. People say they've never seen a black cowboy. Well, we've been there, we've been doing it. I never really learned about the Hispanic, Mexican aspect of the story. This is the history book, but did you know about these other facts? Watch The Real Wild West now on CuriosityStream. Just go to CuriosityStream.com to sign up or download the app now. With new titles dropping every week, you'll never run out of things to watch. And with monthly annual and bundled pricing plans, it's easy to find one that works for you and your budget. Go to CuriosityStream.com to satisfy your curiosity and sign up today. I'm looking through Alana's emails. After she passed, her brother was able to get into her laptop and preserve access to her files and accounts. As I go through her inbox, I'm amused at how Catholic it is. Updates from St. Tom's, heartfelt conversations with nuns, newsletters from an anti-porn group, and many emails with Father Dave. Alana reminds him to share with her the writings of St. John of the Cross, the medieval mystic, which she does. So it looks like he's been introducing her to the saints. And since August of 2015, she's been subscribed to Father Dave's blog, and sends her updates every two to three days with posts like this one about confession from April 2017. I click on it. The post is devoted entirely to masturbation, hell, and sexual purity. Father Dave describes how pornography releases real live demons into your home who have access to your memories, and how looking at porn is actually a slippery slope towards becoming a serial killer. There are a lot of religious groups who've made this connection, similar to what's been said about violent video games and movies. He goes on to elaborate on how masturbation and oral sex are mortal sins worse than pre-marital sex. I'm deeply familiar with these ideas. The sheer fear of demons from hell was a big reason why I was so compulsively and mortally afraid of masturbating or having sexual thoughts about anyone. But I'm baffled by what I read next. He writes, quote, I believe that masturbation is a homosexual act. Many men might think that they feel manly by looking at pictures of women and masturbating, but the reality of it is it's a man's hand that is leading a man to ejaculate. Masturbation may be one reason why so many straight men become gay, end quote. I haven't heard this line of reasoning before, and I can only imagine the impact it might have had on Alana, who's clearly taken to heart so many of these kinds of messages about sin, almost compulsively. But it brings me back to my own teenage years, when I was trying to make sense of it all. My surging hormones, my confusing emotions, my deep desire to follow God. When I met my spiritual director, I finally found someone who had answers, clear rules to follow. And even if I didn't understand everything he said, the way he said it, with confidence and certainty, like the way Father Dave writes, it gave me a deep sense of security. I go back to Alana's timeline. At this point, it's not even funny how much Alana and I have in common. The first person I ever felt safe talking about my sexual and romantic feelings to was also a priest. And like Father Dave, he reacted similarly by downplaying it, telling me it was going to be okay. I remember the sense of relief. Everyone struggles with things, he said. So to me, confessing all this wasn't really coming out, but more like sharing a temptation alongside the many other temptations I was working on. His reassurance gave me a sense of relief, like it was all a work in progress. But as I keep reading, I find something I don't expect. For Alana's own words, Father Dave told her not to tell her parents that she was having romantic feelings towards women. Why would he instruct a minor to keep secrets from her parents? I talked with Alana's mother, Joyce, about this. She didn't know what secrets were being kept from her, but she starts to get suspicious about Alana's frequent confessions. And she eventually discovers that Alana's been meeting with Father Dave, one-on-one, for spiritual direction. So she books an appointment with Father Dave directly, and Alana joins her. Here's how Joyce remembers that meeting. I said, I'm very concerned. You're in here with my daughter, a minor. I imagine the door was shut. I don't know. I have no knowledge of this. I didn't give any consent. She is 14, and you're talking to her about being a nun. And she's young. Like, my daughter needs to go to high school and go to college. And I don't know what you're doing. Like, why don't you ask me? Like, this is outrageous. What happened next took her by surprise. And he just was really smug and right. He was right. And he went on and on and on. He wound up saying that I'm not Catholic, really. And Alana's worried about her dad and her siblings. You know, Carissa has a boyfriend, and she's too young. And he said, how come you're letting her have a boyfriend that young? And then he gives me the Chastity CD. And I was just like, I was blown away. Like, I almost was like in shock. Like, I came here because what you're doing and you have just twisted this whole thing and bashed everyone in my family, including me. Things got heated. So I remember saying to him, he's like, you're not really Catholic. I go, I'm Catholic. But I take what I like and leave the rest. I don't like everything in the Catholic Church. And that is fine. I don't believe in it. I think it's not of Jesus. Some of the things. Because you're not Catholic. There's no such thing as a liberal Catholic. You're Catholic or you're not Catholic. And he started like arguing with me. You know, and I just remember Alana's head was down. She was like, you know, scared. She didn't want me to fight or anything like that. And then Alana spoke up. And she at one point, she was like something like, please, mommy, I want to still see him. And then so then it turned it all around. Like then it was like I said, I felt bad for her. So I said something like she can she can talk to you, but I'm going to be outside waiting with the door open. And then I remembered, OK. And then every time I tried to get that to happen, you know, he texts me a time and I'd say, well, I've got three kids I'm taking to tap dance and ballet and a son to basketball. But like it never coordinated and he didn't try hard at all to make it work. As outrageous as Father Dave's behavior might look, I can totally relate to it. As I learned about my faith from my spiritual director, I saw it as my holy obligation to police who was Catholic and who wasn't. People needed to know the errors of their ways. And if I didn't say anything, I could be culpable for their sins. It also makes sense to me now why Father Dave may have told Alana not to tell her parents. They would have accepted her, maybe even encouraged her to pursue a same sex relationship that would have been going against church teaching. Three months later, Father Dave is reassigned from St. Tom's to another parish in the archdiocese. Joyce is relieved that he's out of the picture. But for Alana, who's in 10th grade at the time, she's losing the only person she feels safe with, the only one who knows her secret. As I returned to the journals, I stumbled across several drafts of a letter written by Alana. Dear Archbishop Aquila, I would like to express gratitude for the loving fatherhood of Father David Nix, who was just recently asked to leave St. John the 23rd. That's his fourth church assignment in three years. I know that in the past he has run into many difficulties. You have probably heard many complaints and accusations about him, and not many good things. I do not know why, but I strongly believe that God chose Father Dave to be an instrument for the salvation of my soul. I met him when I was 14 years old, right as I had dedicated my life to Christ. Father Dave offered to be my spiritual father. He taught me to pray, to read Scripture, to go to Mass and confession. He was the one who told me to volunteer at the gift of Mary's shelter. After he left St. Tom's, he promised he would always be my spiritual father. He has counseled me through doubt and temptation. When I was in danger of leaving the church out of despair, by the grace of God, Father Dave was there. The average church assignment for a Catholic priest is six years, but Father Dave is averaging a little over a year per assignment, and his shortest one, according to the records, lasts less than five months. That doesn't seem right. Alana's defense of Father Dave in writing to his boss, the Archbishop, makes me realize just how important he was to her. And yet, his frequent reassignments raise a lot of questions. According to the Catholic news agency, Father Dave was initially held back from ordination because of, quote, psychological issues. Once he was ordained, it seems he couldn't hold down a job. And while the reasons for why he was moved around aren't totally clear, at least one of them, according to an email he wrote to Alana, involved a spat with a parishioner in which the police were called. The Archdiocese of Denver describes how, quote, after four failed parish assignments, it became very difficult to find a pastor who would receive him, end quote. By 2014, Father Dave was seeking ministry outside of Denver, including at a Latin Mass community in Virginia. But according to the Archdiocese of Denver, in each case, he was asked by these other dioceses to return to Denver. And then I stumble across something else. It's a journal entry that Alana wrote years later, reflecting on her meetings with Father Dave. It's clear that this man played a big role in her adolescent life, and even as a young adult, she's still processing it. I was 14 years old. I didn't tell my parents where I was going. I didn't want anyone to know why I loved God so much. He forgave my unspeakable sin. He took my defilement and buried it. You ought to pray the rosary every day. Later, he said I'd better pray it five times per day to keep the temptation away. He wanted me to be holy, unblemished. He called me a diamond in the rough. The rough being my family. I came to despise my family. Only he was holy. I did everything he told me to do. They cheered when he said he was leaving. I cried. In the wrong hands, a secret can exercise an enormous amount of control, even divide someone from their family. I flashback to the relationship I had with my spiritual director. By college, I was meeting regularly with Father William, confessing to him and talking to him about my problems. And like Alana, I had this confusing part of me that I had never acted out on or told any of my friends or family about. One day, Father William, my spiritual director, sat me down. We'd been talking about me becoming a priest for a while, and I knew this day would come. He looked me in the eyes, smiled, and carefully asked me, Simon, are you ready to answer the Lord's call? Will you join the seminary in September? My heart was pounding. I wanted to leap up and say, yes! The thought of dedicating my life to serving God and his people as a priest gave me so much joy. But I held back. That part of me that could never tell lies knew that something had to be said. There's something I have to tell you, Father William. What's that? He asked. Well, for as long as I can remember, I've struggled with some, um, different sexual feelings. His smile faded. Of what nature? He asked. I looked down. Of the same sex, I said, trying to avoid any loaded terms. Father William's face became like a stone wall. He took out his notebook and his ballpoint pen, wrote something on it, and handed it to me. Take this, he said. These people will fix you. Come back when you're healed. I will follow you. Follow you wherever you may go. Next time on Dear Alana. I believe that homosexuality is linked with difficulties in the early relationship with the same sex parent. We're allowing people to be who they want to be. We're not imposing, we're not forcing people to change, we're just exploring. I will follow you ever since you touched my hand and you. Dear Alana was created, hosted, and written by me, Simon Kent-Fung, and is a production of Tenderfoot TV, in association with Aslept Audio and the Center for Independent Documentary. It was produced by Lori Poliski, who also composed the music. Executive producers are myself, Donald Albright, and Payne Lindsay. Our supervising producer is Tracy Leeds Kaplan. Additional music by Makeup and Vanity Set. Sales and distribution by iHeartMedia. Our voice actor is Alana Rabour, and our credit song, I Will Follow You, is by Toulouse. Show notes and resources can be found on our website, dearalana.com. If you enjoyed this episode, please take time to follow the show, rate, and review. Dear Alana is an 8-part series released weekly. If you can't wait until next week, subscribe to Tenderfoot Plus so you can binge the entire series right now, ad-free. Head to Apple Podcasts or TenderfootPlus.com to subscribe now. With millions of books on Amazon, there's a reading feeling for everyone. For example, Raquel's, Whoa, when she first entered the kingdom by dragonback, is different to Ari's, Whoa, when he found out there was more than one crime scene. Which is also different to Ava's, Whoa, the moment when the stable boy became a stable man. From Whoa, to Whoa, to Whoa, Amazon Books. That reading feeling awaits. Have you cut the cord and are feeling bored with your streaming services? Curiosity Stream can help. With thousands of documentary films and TV shows, let Curiosity Stream put the science back in your screen time. Astound you with history come to life and wildlife that will reach out and grab you. We've got the fix for your nonfiction fascination. With monthly annual and bundled plans, find one for you at CuriosityStream.com."}, "podcast_summary": "In this podcast episode, titled \"Dear Alana Part 3: My Secret,\" the host dives into Alana's journals, which were left behind after her death. The host learns that Alana was deeply religious and had a strong connection to her Catholic faith. She had a spiritual director named Father Dave, who played a significant role in her life, providing guidance and counseling. However, Father Dave's frequent reassignments raised questions, and Alana's mother confronted him about his interactions with her daughter. The host also discovers that Alana struggled with her sexual identity and had romantic feelings toward another girl. These revelations shed light on Alana's complex journey and the impact of her Catholic upbringing.", "podcast_guest": {"name": "Alana", "org": "", "title": "", "summary": "Åland (Swedish: [ˈǒːland] (listen); Finnish: Ahvenanmaa) is an autonomous and demilitarised region of Finland. Receiving its autonomy by a 1920  decision of the League of Nations, it is the smallest region of Finland by both area (1,580 km2) and population (30,129), constituting 0.51% of Finland's land area and 0.54% of its population. Its only official language is Swedish and the capital city is Mariehamn.\nÅland is situated in a Finnish archipelago, called the Åland Islands, at the entrance to the Gulf of Bothnia in the Baltic Sea. It comprises Fasta Åland, on which 90% of the population resides, and about 6,500 skerries and islands to its east, of which about 60–80 are inhabited. Fasta Åland is separated from the coast of Roslagen in Sweden by 38 kilometres (20+1⁄2 nautical miles) of open water to the west. In the east, the Åland archipelago is contiguous with the Finnish archipelago. Åland's only land border is located on the uninhabited skerry of Märket, which it shares with Sweden. From Mariehamn, there is a ferry distance of about 160 kilometres (86 nautical miles) to Turku, a coastal city of mainland Finland, and also to Stockholm, the capital of Sweden.\nÅland's autonomous status means that those provincial powers normally exercised by representatives of the central Finnish Government are largely exercised by its own government. The current demilitarised, neutral position of Åland dates back to the Paris Peace Treaty after the Åland War in the 1850s."}, "podcast_highlights": "- \"I was able to give up masturbation at age 13 until I was 20\"\n- \"Father Dave promised he would always be my spiritual father\"\n- \"I didn't tell my parents where I was going. I didn't want anyone to know why I loved God so much\"\n- \"They cheered when he said he was leaving. I cried\"\n- \"Father William's face became like a stone wall. Take this, he said. These people will fix you\""}