{"podcast_details": {"podcast_title": "The Intelligence from The Economist", "episode_title": "Flight of the long knives: Prigozhin’s reported death", "episode_image": "https://assets.pippa.io/shows/62e286a934d4d93d6587424a/1689776476419-b4e4678d8a2f9264c3a6b3be36f4eb79.jpeg", "episode_transcript": " Hello and welcome to The Intelligence from The Economist. I'm your host Jason Palmer. Every weekday we provide a fresh perspective on the events shaping your world. Most of the doctrine and principle of Islam is decided in the Middle East, but in Indonesia, the world's biggest majority Muslim country, a brand of moderate Islam in harmony with the nation state is growing, and Indonesians would like it to spread. And it sounds like K-pop. It kind of looks like K-pop, but actually it comes from Peru, where one artist from the indigenous Quechua community is pioneering what presumably should be called Q-pop. First up though. We just have some breaking news to bring you now coming out of Russia from the TASS. Breaking news, 10 people have been killed in a private jet crash north of Moscow. We do have this breaking news just into CNN. That is the Wagner mercenary group chief Yevgeny Progozhin has been listed among passengers on board a plane that crashed just north of Moscow. This according to Russian state media, you may remember that… If there's one name the world has heard as often as Putin or Zelensky during the war in Ukraine, it was that of Yevgeny Progozhin. A man who once worked in the shadows with the nickname Putin's Chef had burst into the news, at last admitting that he was the leader of the Wagner group of mercenaries that had long been brutally propping up regimes in Africa and elsewhere. He made headlines again in June. Having railed for months against the leaders of Russia's regular forces, he led a mutinous march on Moscow that was abandoned at the last minute. After that, his fate seemed uncertain. Yesterday it seems to have become clear. Russian media videos flooded the internet, supposedly showing Mr. Progozhin's private plane crashing with him and other Wagner leaders on board. Or at least, that's what Russian authorities announced. President Joe Biden hinted at what many had immediately guessed about the accident. I don't know for a fact what happened, but I'm not surprised. Do you think too much is possible? Not much that happens in Russia, but I don't know enough to know the explanation. Other explanations may emerge, but for many, the narrative is already clear. When I heard the news of Progozhin's private jet crashing with him on board, I thought, well, this is very fitting to the whole Progozhin saga. It's very dramatic. It's very theatrical. It's very much in the style of Vladimir Putin. Arkady Ostrovsky is The Economist's Russia editor. But I was also not surprised at all. In fact, we've been waiting for something like this to happen ever since he led the mutiny against Putin two months ago. Well, before we get into this happening, what exactly do we know and do we not know at this stage? Well, at this stage, we know that a jet which belonged to Progozhin crashed, that all 10 people on board died. We know that the Russian aviation authority said and other Russian official sources said that Progozhin was amongst those who were on board. Also on board was Dmitry Utkin. This is the actual military commander of Wagner. In fact, the man whose call name was Wagner and several other very senior Wagner people were on board. So that's what we know. We don't know the precise cause of this crash. There is a very remote chance this was an accident, but very few people believe that. All things point out that this was a deliberate downing of Progozhin's plane. And if we start from that premise, to come back to your thought, why did it take the Kremlin so long? What would you say to the timing here? Well, you know, as Bill Burns, the director of CIA, pointed two months ago, immediately after Progozhin's mutiny, is that Putin is a master of payback, but also somebody who believes that revenge should be served cold. So Putin very rarely actually acts immediately after something happens. He always takes time and he does always come back. And it's interesting, isn't it, that this coincided both with Ukraine's Independence Day, but more importantly, with some other demotions and changes in the Russian army. In the morning, Sergey Surovikin, a very senior military commander in the Russian army who was close to Progozhin, who we understand sided in a way with Progozhin during his mutiny, certainly the man who Progozhin championed and who for a while commanded Russian forces in the war with Ukraine, was officially dismissed after several weeks of investigation, of disappearing from public view. So it looks like Putin took his time to establish what happened during those days of mutiny two months ago, and he now felt confident to strike against those who led it. And you say that for Mr. Progozhin, this is a fitting end. You think this is all of a piece with his story? You know, it is very fitting with his life and career, but it's also very fitting with the system that Vladimir Putin created. And in that sense, you know, Progozhin was absolutely the flesh and blood of that. It's interesting why Progozhin came and when Progozhin came in the prominence. And basically, he thrust himself and was allowed to thrust himself into the public view. At the time when the Russian army was faltering in Ukraine, he created that myth of alternative force, if you like, and Progozhin spurred the Russian army. He also deflected attention from the disastrous decision that was Putin's invasion in Ukraine. So he served a certain purpose. And Putin is somebody who thrives on creating rivalries between different factions in his circle, like any dictator does. The point is that Putin likes to do that for as long as the conflicts which he sows remain controllable. What happened with Progozhin is that the conflict which Putin thought he was completely in control of started to spin out of control. And what, if any, reaction do you think this is going to provoke within Russia? So in terms of the reaction in Russia, it depends on who we're talking about. The wider public has been watching this show with some amusement since the day of mutiny, but it doesn't really take sides. It sees everything as a spectacle, doesn't expect to be told any truth about the causes of Progozhin's death, but understands that this was a revenge for Progozhin's mutiny. The elite will see this as a restoring of Putin's image as a strong man, Putin consolidating his personal power, will also realize that the only way of resolving conflicts and contradictions in Russia is now by physical elimination, by violence. And in that sense, the elimination of Progozhin will be seen as a sort of further potential threat to any member of the Russian elite who dares to cross Putin. And what do you think it means for the future of the Wagner Group, which Mr. Progozhin created, but now does not lead? Well, Jason, Wagner Group was not just Mr. Progozhin's creation. The Kremlin financed the Wagner all along. I mean, Progozhin might have believed it was his army, but in fact, he was just put in charge of managing it. So I think Wagner probably will get rebranded. The mercenaries will be either put into a different unit or rolled into the forces. The same in Africa, I mean, clearly what Wagner was doing in Africa was not just a private initiative. It was more of a concession. That concession will probably be passed on to somebody else. In terms of what it means for the front in Ukraine, I would put it differently. I think the fact that Progozhin could be disposed of is a sign of consolidation of the Russian army and the Russian forces. We've seen this over the past two months, that Russia has been actually more effective in fending off Ukrainian counter-offensive. This certainly restores the role of the regular chiefs of army, Sergei Shoigu and Valeriy Gerasimov, the Minister of Defense and the command of the Russian forces, as the chiefs of this military operation. But Mr. Putin will have a more clearly defined iron hand, iron fist running at all. On the one hand, of course, it will consolidate Putin's power in the short term in the eyes of the elite. He proved himself to be a strong man who can strike and wipe out his opponent. It evokes some parallels with the Knight of Long Knives, with what Hitler did in the 1930s, crashing his own, the commanders of his paratroopers. On the other hand, it's a further evidence that Russia is fast becoming not a regular state but a mafia-type organization. Violence is now the only way of resolving conflicts, and this will, I think, destabilize Russia as a political system further, making it more brittle and more unpredictable. Akhadi, thank you very much for your time. Thank you, Jason. Indonesia is the world's most populous Muslim-majority country, nearly 90% of its 237 million people practice Islam. But when it comes to the big Islamic debates, the country has long punched below its weight. Dominant ideas, both spiritual and political, have traditionally come from the Middle East. And in recent years, it seemed that Islamist extremism might also be making its way into Indonesia. But a closer look reveals that the country's Muslims increasingly want to have their own say on how their religion shapes their society. Indonesia has six official religions, Islam, Catholicism, Protestantism, Buddhism, Hinduism, and Confucianism. Su Lin Wong is a Southeast Asia correspondent for The Economist. But the country-state ideology, which is known as panchusilla, encourages moderation and explicitly allows religious freedom. So what's really interesting about panchusilla is that it forbids atheism, but it allows religious freedom. And now Indonesia's main Muslim organizations are pushing for a more inclusive and tolerant Islam that reflects the spirit of panchusilla. So tell us more about those organizations. Well the largest Muslim civil society organization in Indonesia is called Nalatul Ulama, or NU. It claims to have over 100 million followers, including several members of President Joko Widodo's cabinet. It also runs 23,000 Islamic boarding schools and over 250 universities. In February, over a million of its followers clogged the streets of a city in East Java for the group's centenary celebrations. Many of the country's top political figures, including the president, attended the event. And at the event, NU formally called for the abandonment of the caliphate, which is a notional authority that is considered to oversee all Muslims. So what is meant by that rejecting the caliphate? So what NU was saying is that the concept of a caliphate may be made sense, you know, many, many hundreds of years ago, but the world has evolved such that the concept of a caliphate is outdated and should be replaced with something like the concept of a nation-state. The group has also previously called on Muslims to reject the concept of an infidel and accept non-Muslims as fellow citizens. All of this may sound pretty modest, but coming from the world's largest Muslim civil society organization, it really was significant. I spoke to Ulil Abshar Abdullah, a senior NU official, and he told me about the changes he wants to see when it comes to Islam in Indonesia. So the challenge for us as a moderate Muslim going forward is to navigate this imperative of maintaining our tradition that we cherish so much. You cannot practice Islam as it was practiced by our forefathers, mothers in the past, without significant changing in our understanding and interpretation. And you had mentioned that moderation was kind of baked into the state ideology. Was Indonesia not always on this kind of path? So Panjusila has always encouraged moderation in Indonesia, but that having been said, Indonesia wasn't always on this path. In the early 2000s, there were a spate of bombings that were pushed by groups that had links to Al-Qaeda and wanted a Southeast Asian Islamic state. They sort of really grew in power over time until 2016, when the power of radical Islamic groups really peaked. The then governor of Jakarta, who was a Chinese Christian known as Ahok, was convicted of blasphemy charges and imprisoned for two years because of attacks by hardline Islamic groups. So for President Joko Widodo, that really was a turning point and his administration clamped down. It banned two hardline Islamic groups and has really been pushing for more moderation in how Islam is practiced in Indonesia. But is there still a conflict there? Are those hardline groups still present in Indonesia making themselves known? A lot of them have gone underground, so it's definitely something to keep an eye on. But when I spoke to Ulil, what he said was that he thinks the failure of Al-Qaeda and Islamic State have helped the government's push. The failure of the Al-Qaeda and ISIS project globally makes people rethink what they think about ISIS and so forth. So they come to the realization that this is a flawed project. On top of that is funding from Saudi Arabia. So Saudi money had been flowing to Islamic groups in Indonesia for many years, but even that has dropped off under Mohammed bin Salman, the Saudi Arabian crown prince. And one thing I found really interesting as I was researching the story was the rise of the Hijra movement, which is a conservative subculture popular among some young urban Muslims in Indonesia. But in May, the leader of this movement joined NU. So there's a lot of coverage in Western media about rising extremism and rising Islamism in Indonesia. But in fact, what I found in my research is that it's really not as simple as that. And in fact, there are lots of moderate Muslims and these large civil society organizations like NU that are pushing for a different vision of what Islam is. And now NU is really trying to export that to the world. Sulin, thanks very much for your time. Thanks very much, Jason. The music kicks in a big synth bassline. He's dressed in a black leather jacket, his slick black hair parted across his face. Behind him are his four backup dancers dressed in white t-shirts. They start moving in sync with the beat. Mitra Taj writes about Peru for The Economist. Lenin looks like he could be a K-pop star. His music even sounds like K-pop, but Lenin is not Korean. He's Quechua, an indigenous minority in Peru. Listen carefully to the lyrics and you'll hear that he's singing in Spanish and Quechua, which is the most widely spoken indigenous language in Peru. The lyrics are defiant. He's challenging his critics by saying, what is it that you see in me? Your heart is already dead. I like it because it's really, really catchy. His fans call his music Q-pop, short for Quechua pop. He sees his music as a platform for indigenous culture. His compositions blend Korean style beats and ballads mixed with Andean instruments and sounds. He writes choruses and rap interludes in Quechua, the most widely spoken indigenous language in the Americas. His video features choreographies infused with folk dance moves and costumes with traditional flair such as devil masks that are worn at highland parades. I met Lenin recently at a mall in Lima to talk about his music. He was there rehearsing with his dancers because he has a studio there. I was interested in how he came to hear about K-pop and what he saw in it. Lenin said he experienced discrimination because of his indigenous background and he was bullied at school. He's slight with high cheekbones. He felt different until a friend showed him a K-pop video. He saw K-pop stars who looked kind of like he did. They were also skinny. They also had straight black hair and similar body shapes. But they were famous. They were global superstars. He was transported. He told me that K-pop was a release. My mind would come up with these narratives, parallel worlds, and that somehow helped me cope with school. It'd give you hope. You knew you were never going to go to Korea and would never be a K-pop star. But just by imagining that possibility, it would give you a feeling of hope. And that feeling of hope is something that many K-pop fans feel. It's why people all over the world fill stadiums to see their favorite K-pop groups. Lenin is far from the first non-Korean to dabble in K-pop, which itself drew inspiration from American hip hop. K-pop has been so big for so long that artists have emerged from the UK to Thailand and Vietnam. Backed by record labels, they tend to imitate K-pop rather than reinvent it. But Lenin is not just copying K-pop. It's a vehicle for him, one that allows him to blend his traditional culture and make it accessible for a modern and global audience. He told me that when he fuses both worlds, I realize that I have the power of glamour, fashion, fame, aesthetics, plasticity, all that is bright and shiny. But I also have the depth, the message, and the human and social content of Andean music. That's what's piquing the attention of music lovers the world over, not just in Peru. He's already getting 5 million listens a month on TikTok, the social media platform. He told me my music is protest. Because a young Peruvian man who makes K-pop in Quechua, who's named Lenin, has so much to say. That's all for this episode of The Intelligence. We've got some news for you if you're a subscriber. The Economist's app now has a dedicated tab for this show and for all of our podcasts. It's the easiest way to tune in every day. And if you're not a subscriber, what are you waiting for? We've got a free 30-day digital subscription. Just go to economist.com slash intelligence offer or click the link in the show notes. We'll see you back here tomorrow. The world is unpredictable, but it's also understandable. Economist Education offers a six-week online course on international relations. Designed by the Economist's editors and invited experts, it gives you the knowledge and insight to navigate the rapidly changing worlds of geopolitics, business and technology. And as a listener, enjoy a 15% discount with the code POLITICS. You can sign up now at economist.com forward slash international relations."}, "podcast_summary": "In this podcast episode, three different topics are discussed. Firstly, there is a report on the plane crash involving the Russian Wagner mercenary group chief Yevgeny Progozhin, who had previously led a mutiny against Putin. Secondly, the podcast explores the rise of moderate Islam in Indonesia, where the country's largest Muslim civil society organization, Nalatul Ulama, is pushing for a more inclusive and tolerant form of Islam. Lastly, the episode highlights the story of Lenin, a Quechua artist from Peru who is blending K-pop with Andean culture, creating his own style called Q-pop. The podcast touches on the significance of his music as a platform for indigenous culture and a form of protest.", "podcast_guest": {"name": "Jason Palmer", "org": "", "title": "", "summary": "Not Available"}, "podcast_highlights": "- Highlight 1 of the podcast: \"When I heard the news of Progozhin's private jet crashing with him on board, I thought, well, this is very fitting to the whole Progozhin saga. It's very dramatic. It's very theatrical. It's very much in the style of Vladimir Putin.\"\n- Highlight 2 of the podcast: \"So Putin very rarely actually acts immediately after something happens. He always takes time and he does always come back. And it's interesting, isn't it, that this coincided both with Ukraine's Independence Day, but more importantly, with some other demotions and changes in the Russian army.\"\n- Highlight 3 of the podcast: \"What happened with Progozhin is that the conflict which Putin thought he was completely in control of started to spin out of control.\"\n- Highlight 4 of the podcast: \"So in terms of the reaction in Russia, it depends on who we're talking about. The wider public has been watching this show with some amusement since the day of mutiny, but it doesn't really take sides. The elite will see this as a restoring of Putin's image as a strong man, Putin consolidating his personal power, will also realize that the only way of resolving conflicts and contradictions in Russia is now by physical elimination, by violence.\"\n- Highlight 5 of the podcast: \"On the one hand, of course, it will consolidate Putin's power in the short term in the eyes of the elite. He proved himself to be a strong man who can strike and wipe out his opponent. On the other hand, it's a further evidence that Russia is fast becoming not a regular state but a mafia-type organization.\""}